In [13]:
 ![png](Images/BooksERD.png)

zsh:1: number expected

In [6]:
import pymysql
pymysql.install_as_MySQLdb()
from sqlalchemy import create_engine
from urllib.parse import quote_plus as urlquote
from sqlalchemy_utils import create_database, database_exists
# Create connection string using credentials following this format
# connection = "dialect+driver://username:password@host:port/database"
## Change username and password to match your personal MySQL Server settings
username = 'root' # default username for MySQL db is root
password = 'Houriais@123' # whatever password you chose during MySQL installation.

connection_str = f'mysql+pymysql://{username}:{urlquote(password)}@localhost/Books'

In [7]:
#creating the engine
engine = create_engine(connection_str)

In [8]:
#creating the new database
create_database(connection_str)

#checking to see if the datbase was created
database_exists(connection_str)

True

In [12]:
#importing the data sets as csv
import pandas as pd
df1 = pd.read_csv('Data/users.csv')
df2 = pd.read_csv('Data/books.csv')
df3 = pd.read_csv('Data/authors.csv')
df4 = pd.read_csv('Data/favorites.csv')
df1.head()

   id first_name  last_name                 email
0   1       John        Doe          JD@books.com
1   2      Robin      Smith       Robin@books.com
2   3     Gloria  Rodriguez  grodriquez@books.com

In [14]:
#converting csv data sets to mysql database
df1.to_sql('users', engine, if_exists = 'replace')
df2.to_sql('books', engine, if_exists = 'replace')
df3.to_sql('authors', engine, if_exists = 'replace')
df4.to_sql('favorites', engine, if_exists = 'replace')

7

In [15]:
#checking to see if the table was created in the database
q = """SELECT * FROM users LIMIT 5;"""
pd.read_sql(q, engine)

   index  id first_name  last_name                 email
0      0   1       John        Doe          JD@books.com
1      1   2      Robin      Smith       Robin@books.com
2      2   3     Gloria  Rodriguez  grodriquez@books.com

In [16]:
#test query
q1 = '''SELECT books.title, favorites.user_id
FROM books
JOIN favorites ON books.id = favorites.book_id
WHERE favorites.user_id = 
    (SELECT users.id FROM users WHERE (users.last_name = "Doe" AND users.first_name = "John"));'''
pd.read_sql(q1, engine)

              title  user_id
0       The Shining        1
1                It        1
2  The Great Gatsby        1